# REF: https://github.com/dfeich/org-babel-examples/blob/master/beamer/beamer-example.org
#+TITLE:     Linear Systems: Matrices, eigen-values, ... 
#+SUBTITLE:  Herramientas de Modelación - Maestría en Gestión y Diseño de Procesos
#+AUTHOR:    William Oquendo, woquendo@gmail.com
#+EMAIL:     woquendo@gmail.com
#+DATE:

#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   num:t toc:t ::t |:t ^:{} -:t f:t *:t <:t
#+OPTIONS:   tex:t d:nil todo:t pri:nil tags:nil
#+OPTIONS:   timestamp:t

# started this on 2010-03-30 Tue

# this allows defining headlines to be exported/not be exported
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport

# By default I do not want that source code blocks are evaluated on export. Usually
# I want to evaluate them interactively and retain the original results.
#+PROPERTY: header-args :eval export

** Using =scipy=
   See [[https://docs.scipy.org/doc/scipy/reference/generated/scipy.linalg.inv.html#scipy.linalg.inv][inverse with =scipy=]]
   #+BEGIN_SRC python :exports both :results output 
from scipy import linalg
import numpy as np
A = np.array([[1., 2.], [3., 4.]])
B = linalg.inv(A)
print(B)
# verify
print(A.dot(B))
   #+END_SRC

   #+RESULTS:
   : [[-2.   1. ]
   :  [ 1.5 -0.5]]
   : [[1.0000000e+00 0.0000000e+00]
   :  [8.8817842e-16 1.0000000e+00]]

   
   You can watch: https://www.youtube.com/watch?v=uQhTuRlWMxw
** LU 
   You can specifically solve with LU factorization. See [[https://docs.scipy.org/doc/scipy/reference/generated/scipy.linalg.lu_solve.html#scipy.linalg.lu_solve][docs]] .
   #+BEGIN_SRC python :exports both :results output
from scipy.linalg import lu_factor, lu_solve
import numpy as np
A = np.array([[2, 5, 8, 7], [5, 2, 2, 8], [7, 5, 6, 6], [5, 4, 4, 8]])
b = np.array([1, 1, 1, 1])
lu, piv = lu_factor(A)
x = lu_solve((lu, piv), b)
print(x)
print(A.dot(x) - b)
   #+END_SRC

   #+RESULTS:
   : [ 0.05154639 -0.08247423  0.08247423  0.09278351]
   : [0. 0. 0. 0.]
** Cholesky
   Or you can use the Cholesky factorization. 
   See [[https://docs.scipy.org/doc/scipy/reference/generated/scipy.linalg.cho_solve.html#scipy.linalg.cho_solve][Cholesky docs]] . The matrix must be positive definite. 
   #+BEGIN_SRC python :exports both :results output
from scipy.linalg import cho_factor, cho_solve
import numpy as np
A = np.array([[9, 3, 1, 5], [3, 7, 5, 1], [1, 5, 9, 2], [5, 1, 2, 6]])
b = np.array([1, 1, 1, 1])
c, low = cho_factor(A)
x = cho_solve((c, low), b)
print(x)
print(A.dot(x) - b)
   #+END_SRC

   #+RESULTS:
   : [-0.01749271  0.11953353  0.01166181  0.1574344 ]
   : [2.22044605e-16 2.22044605e-16 0.00000000e+00 0.00000000e+00]

